---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotGetSketchReferences
source: html/b7535d2a-41b4-87d4-d908-480a82d99dfa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotGetSketchReferences Property

Cannot find references to dimension sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotGetSketchReferences { get; }
```